In [2]:
import numpy as np 
import pandas as pd
from pandas import Series, DataFrame

In [3]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [4]:
np.concatenate([arr1, arr1], axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [5]:
np.concatenate([arr1,arr1], axis = 0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [6]:
ser1 = Series([0,1,2],index = ['T','U','V'])

ser2 = Series([3,4], index = ['X','Y'])

In [7]:
ser1

T    0
U    1
V    2
dtype: int64

In [8]:
ser2

X    3
Y    4
dtype: int64

In [9]:
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [11]:
pd.concat([ser1,ser2], axis=1)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [12]:
pd.concat([ser1,ser2],keys=['cat1','cat2'])

cat1  T    0
      U    1
      V    2
cat2  X    3
      Y    4
dtype: int64

In [13]:
dframe1 = DataFrame(np.random.randn(4,3), columns=['X','Y','Z'])

dframe2 = DataFrame(np.random.randn(3,3), columns=['Y','Q','X'])

In [15]:
dframe1

          X         Y         Z
0 -0.402350  0.242363 -0.342378
1 -0.092041  1.451056 -0.596684
2  0.665645 -0.748802  1.272599
3 -0.670620 -1.352829 -0.259968

In [16]:
dframe2

          Y         Q         X
0  2.030661  2.067583 -0.727593
1  1.753233  0.537623  0.592602
2  0.675492  2.066548 -0.774523

In [17]:
pd.concat([dframe1, dframe2])

          Q         X         Y         Z
0       NaN -0.402350  0.242363 -0.342378
1       NaN -0.092041  1.451056 -0.596684
2       NaN  0.665645 -0.748802  1.272599
3       NaN -0.670620 -1.352829 -0.259968
0  2.067583 -0.727593  2.030661       NaN
1  0.537623  0.592602  1.753233       NaN
2  2.066548 -0.774523  0.675492       NaN

In [19]:
pd.concat([dframe1, dframe2], axis=1)

          X         Y         Z         Y         Q         X
0 -0.402350  0.242363 -0.342378  2.030661  2.067583 -0.727593
1 -0.092041  1.451056 -0.596684  1.753233  0.537623  0.592602
2  0.665645 -0.748802  1.272599  0.675492  2.066548 -0.774523
3 -0.670620 -1.352829 -0.259968       NaN       NaN       NaN

In [20]:
pd.concat([dframe1, dframe2], ignore_index=True)

          Q         X         Y         Z
0       NaN -0.402350  0.242363 -0.342378
1       NaN -0.092041  1.451056 -0.596684
2       NaN  0.665645 -0.748802  1.272599
3       NaN -0.670620 -1.352829 -0.259968
4  2.067583 -0.727593  2.030661       NaN
5  0.537623  0.592602  1.753233       NaN
6  2.066548 -0.774523  0.675492       NaN